// See https://aka.ms/new-console-template for more information
Console.WriteLine("Hello, World!");


// 1. Напишите программу, которая принимает на вход трёхзначное число и на выходе
// показывает последнюю цифру этого числа.
// 456 -> 6
// 782 -> 2
// 918 -> 8

int x1 = 456 % 10;
int x2 = 782 % 10;
int x3 = 918 % 10;

Console.WriteLine(x1 , x2 , x3)
